Repository: sh0ckj0ckey/Honeypot
Catalog: Honeypot/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# DisplayName
source: Honeypot
zh_cn: 密罐

# DisplayDesc
source: Keep Your Sweet Passwords Safe
zh_cn: 妥善保存蜜码

# PackageName
source: Honeypot
zh_cn: 密罐

# AppNameTextBlock.Text
source: Honeypot
zh_cn: 密罐

# LockedTextBlock.Text
source: Honeypot is Locked
zh_cn: 密罐已锁定

# UnlockTextBlock.Text
source: Click to unlock with Windows Hello
zh_cn: 点击以使用 Windows Hello 解锁

# UnknownCategoryTitle
source: Uncategorized
zh_cn: 未分类

# AddingCategoryNameTextBox.PlaceholderText
source: Category Name
zh_cn: 新建分类名称

# NoFluentIconTextBlock.Text
source: It seems that your device doesn't have the Segoe Fluent Icons font, in which case you can't set the icons :(
zh_cn: 您的设备似乎没有 Segoe Fluent Icons 字体，这样的话无法设置图标哦

# LogoCropperSelectImageTextBlock.Text
source: Choose Image
zh_cn: 选择图片

# DetailAccountTextBlock.Text
source: Account
zh_cn: 账号

# DetailAccountCopyButton.ToolTipService.ToolTip
source: Click to copy account
zh_cn: 点击以复制账号

# EmptyAccountButtonTextBlock.Text
source: Account not provided
zh_cn: 未填写账号

# DetailPasswordTextBlock.Text
source: Password
zh_cn: 密码

# DetailPasswordCopyButton.ToolTipService.ToolTip
source: Click to copy password
zh_cn: 点击以复制密码

# EmptyPasswordButtonTextBlock.Text
source: Password not provided
zh_cn: 未填写密码

# LogoEditSelectImageTextBlock.Text
source: Choose Image
zh_cn: 选择图片

# EditingAccountTextBox.PlaceholderText
source: Account
zh_cn: 账号

# EditingPasswordTextBox.PlaceholderText
source: Password
zh_cn: 密码

# EditingCategoryComboBox.PlaceholderText
source: Select Category
zh_cn: 选择分类

# EditingCategoryRemoveButton.ToolTipService.ToolTip
source: Remove category
zh_cn: 取消分类

# EditingWebsiteTextBox.PlaceholderText
source: Website
zh_cn: 网站

# EditingNoteTextBox.PlaceholderText
source: Note
zh_cn: 备注

# AddingTitleTextBlock.Text
source: Add
zh_cn: 添加

# AddingNameTextBox.PlaceholderText
source: Name
zh_cn: 名称

# AddingAccountTextBlock.Text
source: Account
zh_cn: 账号

# AddingAccountTextBox.PlaceholderText
source: Account
zh_cn: 账号

# AddingPasswordTextBlock.Text
source: Password
zh_cn: 密码

# AddingPasswordRecipeTextBlock.Text
source: Password Recipe
zh_cn: 密码配方

# AddingPasswordRecipeLetterTextBlock.Content
source: Letters
zh_cn: 字母

# AddingPasswordRecipeNumberTextBlock.Content
source: Numbers
zh_cn: 数字

# AddingPasswordRecipeSymbolTextBlock.Content
source: Symbols
zh_cn: 特殊字符

# AddingPasswordLengthTextBlock.Text
source: Length
zh_cn: 密码长度

# AddingPasswordTextBox.PlaceholderText
source: Password
zh_cn: 密码

# AddingGeneratePasswordSplitButton.ToolTipService.ToolTip
source: Generate random password
zh_cn: 随机密码

# AddingFavoriteTextBlock.Text
source: Favorite
zh_cn: 收藏夹

# AddingFavoriteCheckBox.Content
source: Add to Favorites
zh_cn: 添加到收藏夹

# AddingCategoryTextBlock.Text
source: Category
zh_cn: 分类

# AddingCategoryComboBox.PlaceholderText
source: Select Category
zh_cn: 选择分类

# AddingWebsiteTextBlock.Text
source: Website
zh_cn: 网站

# AddingNoteTextBlock.Text
source: Note
zh_cn: 备注

# AddingNoteTextBox.PlaceholderText
source: Note
zh_cn: 备注

# CopiedInfoBar.Title
source: Password copied
zh_cn: 密码已复制

# CopiedInfoBar.Message
source: Each time a random password is generated, it will be automatically copied to the clipboard.
zh_cn: 每次点击生成随机密码后，会自动复制到剪贴板。

# CopiedInfoBarDismissCheckBox.Content
source: Don't show again
zh_cn: 不再提示

# AddingButtonTextBlock.Text
source: Add
zh_cn: 添加

# CategoriesTitleTextBlock.Text
source: Categories
zh_cn: 全部分类

# CategoriesAddButtonTextBlock.Text
source: New Category
zh_cn: 新建分类

# CategoriesMoveToTopMenuItem.Text
source: Move to front
zh_cn: 置于最前

# CategoriesEditMenuItem.Text
source: Edit
zh_cn: 编辑

# CategoriesDeleteMenuItem.Text
source: Delete
zh_cn: 删除

# FavoritesTitleTextBlock.Text
source: Favorites
zh_cn: 收藏夹

# MainWindow.Title
source: Honeypot
zh_cn: 密罐

# RandomTitleTextBlock.Text
source: Random Password Generator
zh_cn: 随机密码生成器

# RandomDescriptionTextBlock.Text
source: Generate a random and hard-to-remember password
zh_cn: 产生一个随机的、难以记住的密码

# RandomTipsTextBlock.Text
source: Click to generate password on the right
zh_cn: 点击右侧按钮，生成密码

# RandomRecipeTextBlock.Text
source: Password Recipe
zh_cn: 密码配方

# RandomLetterToggle.OffContent
source: Letters
zh_cn: 字母

# RandomLetterToggle.OnContent
source: Letters
zh_cn: 字母

# RandomNumberToggle.OffContent
source: Numbers
zh_cn: 数字

# RandomNumberToggle.OnContent
source: Numbers
zh_cn: 数字

# RandomSymbolToggle.OffContent
source: Symbols
zh_cn: 特殊字符

# RandomSymbolToggle.OnContent
source: Symbols
zh_cn: 特殊字符

# RandomLengthTextBlock.Text
source: Length
zh_cn: 密码长度

# RandomGenerateButton.ToolTipService.ToolTip
source: Click and copy
zh_cn: 生成并复制结果

# RandomCopiedInfoBar.Title
source: Password copied
zh_cn: 密码已复制

# RandomCopiedInfoBar.Message
source: Each time a random password is generated, it will be automatically copied to the clipboard.
zh_cn: 每次点击生成随机密码后，会自动复制到剪贴板。

# RandomCopiedDismissCheckBox.Content
source: Don't show again
zh_cn: 不再提示

# NavigationItemAllPasswords
source: All Passwords
zh_cn: 所有账号

# PasswordsSearchAutoSuggestBox.PlaceholderText
source: Search on this page
zh_cn: 在当前页面中搜索

# PasswordsTotalCountTextBlockRun1.Text
source: Total:
zh_cn: 共

# PasswordsTotalCountTextBlockRun2.Text
source: password(s)
zh_cn: 个账号

# PasswordsSortByLetterSegmentedItem.ToolTipService.ToolTip
source: Sort by name
zh_cn: 按首字母排序

# PasswordsSortByTimeSegmentedItem.ToolTipService.ToolTip
source: Sort by date added
zh_cn: 按添加时间排序

# PasswordsDetailAccountTextBlock.Text
source: Account
zh_cn: 账号

# PasswordsDetailAccountButton.ToolTipService.ToolTip
source: Click to copy account
zh_cn: 点击以复制账号

# PasswordsDetailAccountEmptyTextBlock.Text
source: Account not provided
zh_cn: 未填写账号

# PasswordsDetailPasswordTextBlock.Text
source: Password
zh_cn: 密码

# PasswordsDetailPasswordButton.ToolTipService.ToolTip
source: Click to copy password
zh_cn: 点击以复制密码

# PasswordsDetailPasswordEmptyTextBlock.Text
source: Password not provided
zh_cn: 未填写密码

# PasswordsDetailWebsiteTextBlock.Text
source: Website
zh_cn: 网站

# PasswordsDetailNoteTextBlock.Text
source: Note
zh_cn: 备注

# PasswordsDetailAddDateTextBlock.Text
source: Created on
zh_cn: 创建于

# PasswordsDetailEditDateTextBlock.Text
source: Last modified on
zh_cn: 上次修改于

# PasswordsDetailDeleteTextBlock.Text
source: Delete this password
zh_cn: 删除账号

# PasswordsDetailDeleteTextBlockRun1.Text
source: Are you sure you want to delete
zh_cn: 确认要删除

# PasswordsDetailDeleteTextBlockRun2.Text
source: ? The association of third-party login between this account and other accounts will also be cleared.
zh_cn: 吗，删除后将无法恢复哦。

# PasswordsDetailDeleteConfirmButton.Content
source: Confirm
zh_cn: 确认删除

# PasswordsRememberBackupInfoBar.Title
source: Don't forget to back up
zh_cn: 记得备份

# PasswordsRememberBackupLearnMoreButton.Content
source: Learn More
zh_cn: 了解更多

# SettingsTitleTextBlock.Text
source: Settings
zh_cn: 设置

# SettingsAppNameTextBlock.Text
source: Honeypot
zh_cn: 密罐

# SettingsAppSloganTextBlock.Text
source: Keep Your Sweet Passwords Safe
zh_cn: 妥善保存蜜码

# SettingsRateTextBlock.Text
source: Rate and Review
zh_cn: 打分评价

# SettingsPersonalizationTextBlock.Text
source: Personalization
zh_cn: 个性化

# SettingsThemeSettingsCard.Header
source: Theme
zh_cn: 主题

# SettingsThemeSettingsCard.Description
source: Select theme of the "Honeypot"
zh_cn: 选择 "密罐" 的外观

# SettingsThemeDefaultComboBoxItem.Content
source: System
zh_cn: 跟随系统

# SettingsThemeDarkComboBoxItem.Content
source: Dark
zh_cn: 黑暗

# SettingsThemeLightComboBoxItem.Content
source: Light
zh_cn: 明亮

# SettingsBackdropSettingsCard.Header
source: Backdrop
zh_cn: 背景

# SettingsBackdropSettingsCard.Description
source: Select backdrop material of the "Honeypot"
zh_cn: 选择 "密罐" 的背景材质

# SettingsBackdropMicaComboBoxItem.Content
source: Mica
zh_cn: 云母

# SettingsBackdropAcrylicComboBoxItem.Content
source: Acrylic
zh_cn: 亚克力

# SettingsSecurityDataTextBlock.Text
source: Security and Data
zh_cn: 安全和数据

# SettingsMigrateSettingsCard.Header
source: Migrate
zh_cn: 迁移数据

# SettingsMigrateSettingsCard.Description
source: Import data from "ManyPasswords" into "Honeypot"
zh_cn: 将 "好多密码" 的数据导入到 "密罐" 中

# SettingsStartMigrateTextBlock.Text
source: Start Migration
zh_cn: 开始迁移

# SettingsLockSettingsCard.Header
source: Lock app with Windows Hello
zh_cn: 使用 Windows Hello 锁定应用

# SettingsLockViewWindowsHelloSettingButton.Content
source: Check in "Windows Settings"
zh_cn: 在 "系统设置" 中查看

# SettingsDataFileSettingsCard.Header
source: Data files
zh_cn: 数据文件

# SettingsDataFileSettingsCard.Description
source: Passwords are stored in plain text, please handle them carefully
zh_cn: 密码明文保存，请妥善保管

# SettingsViewDataFileTextBlock.Text
source: Go to View Files
zh_cn: 前往查看

# SettingsAboutTextBlock.Text
source: About
zh_cn: 关于

# SettingsContactSettingsCard.Header
source: Contact me
zh_cn: 与我联系

# SettingsContactSettingsCard.Description
source: If you encounter any issues or have any suggestions
zh_cn: 如果您遇到问题或有任何建议

# SettingsContactQQButton.Visibility
source: Collapsed
zh_cn: Visible

# SettingsContactWeChatButton.Visibility
source: Collapsed
zh_cn: Visible

# SettingsCodeSettingsCard.Header
source: Source code
zh_cn: 源代码

# SettingsCodeSettingsCard.Description
source: Go to GitHub to view the source code
zh_cn: 前往 GitHub 查看源代码

# SettingsGithubTextBlock.Text
source: GitHub Repository
zh_cn: GitHub 存储库

# SettingsZhuqueSettingsCard.Header
source: Zhuque Fangsong
zh_cn: 朱雀仿宋

# SettingsZhuqueSettingsCard.Description
source: This application uses the open-source font "Zhuque Fangsong"
zh_cn: 此应用程序使用了开源字体 "朱雀仿宋"

# SettingsZhuqueGithubTextBlock.Text
source: Zhuque on GitHub
zh_cn: GitHub 页面

# SettingsEmailButton.Text
source: Send Email
zh_cn: 发送邮件

# NavigationItemFavorites
source: Favorites
zh_cn: 收藏夹

# NavigationItemAdd
source: Add
zh_cn: 添加

# NavigationItemCategories
source: Categories
zh_cn: 全部分类

# NavigationItemGenerator
source: Password Generator
zh_cn: 密码生成器

# NavigationItemTips
source: Tips
zh_cn: 使用提示

# NavigationItemSettings
source: Settings
zh_cn: 设置

# DialogTitleOops
source: Oops...
zh_cn: 糟糕...

# DialogContentWrongConnectToDb
source: An error occurred while connecting to the database
zh_cn: 连接数据库时出现了异常

# DialogContentWrongLoadCategories
source: An error occurred while loading Categories
zh_cn: 读取分类列表时出现了异常

# DialogContentWrongAddCategories
source: An error occurred while adding the category
zh_cn: 添加分类时出现了异常

# DialogContentWrongEditCategories
source: An error occurred while editing the category
zh_cn: 编辑分类时出现了异常

# DialogContentWrongMoveCategories
source: An error occurred while moving the category
zh_cn: 移动分类时出现了异常

# DialogContentWrongDeleteCategories
source: An error occurred while deleting the category
zh_cn: 删除密码时出现了异常

# DialogContentWrongAddFavorite
source: An error occurred while adding the password to Favorites
zh_cn: 收藏密码时出现了异常

# DialogContentWrongLoadPasswords
source: An error occurred while loading Passwords
zh_cn: 读取密码列表时出现了异常

# DialogContentWrongEditPasswords
source: An error occurred while editing the password
zh_cn: 编辑密码时出现了异常

# DialogContentWrongDeletePasswords
source: An error occurred while deleting the password
zh_cn: 删除密码时出现了异常

# DialogContentWrongAddPasswords
source: An error occurred while adding the password
zh_cn: 添加密码时出现了异常

# DialogButtonConfirm
source: Confirm
zh_cn: 确定

# DialogButtonCancel
source: Cancel
zh_cn: 取消

# DialogButtonGotIt
source: Got it
zh_cn: 我知道了

# DialogTitleCropImage
source: Crop Image
zh_cn: 裁剪图像

# DialogTitleNotEnough
source: Not enough...
zh_cn: 还不够...

# DialogContentCompleteName
source: Name cannot be empty, please fill it in.
zh_cn: 名称不能为空哦，再完善一下吧~

# DialogContentCompleteAccountOrPassword
source: Please enter at least one of the account or password.
zh_cn: 账号和密码至少要填写一个哦，再完善一下吧~

# DialogButtonSave
source: Save
zh_cn: 保存

# DialogTitleEdit
source: Edit
zh_cn: 编辑

# DialogTitleConfirmDelete
source: Delete
zh_cn: 删除

# DialogButtonClose
source: Close
zh_cn: 关闭

# DialogButtonRemoveFavorite
source: Remove from Favorites
zh_cn: 取消收藏

# DialogContentConfirmDelete
source: Are you sure you want to delete this category?
zh_cn: 确定要删除吗，删除后将无法恢复

# DialogTitleNewCategory
source: New Category
zh_cn: 新建分类

# DialogButtonNewCategory
source: Confirm
zh_cn: 创建

# DialogTitleEditCategory
source: Edit Category
zh_cn: 编辑分类

# DialogButtonEditCategory
source: Confirm
zh_cn: 修改

# DialogContentDeleteCategory1
source: Are you sure you want to delete
zh_cn: 确定要删除分类

# DialogContentDeleteCategory2
source: ? The passwords under this category will not be deleted.
zh_cn: 吗？该分类下的密码不会被删除。

# UnlockAppUnlockingMessage
source: Honeypot needs to verify it’s you to continue
zh_cn: 密罐需要确认您的身份才能继续

# UnlockAppUnlockFailed
source: Verification failed
zh_cn: 无法验证身份

# UnlockAppDeviceUnavailable
source: The verifier device is not configured or is disabled by plicy
zh_cn: 当前识别设备未配置或被系统策略禁用

# UnlockAppDeviceBusy
source: The verifier device is busy now, please try again later.
zh_cn: 当前识别设备正忙，请稍后重试

# UnlockAppRetriesExhausted
source: Too many failed verification attempts
zh_cn: 验证失败次数过多

# UnlockAppError
source: Something went wrong
zh_cn: 验证出错了

# BackupRemindSoMany
source: Wow, you've already stored so many passwords, that's great! But remember to back up your data regularly to avoid the risk of losing it.
zh_cn: 哇，你已经记录了这么多个账号，真不错，但是要记得定期备份一下数据哦，不要让数据面临丢失的风险。

# BackupRemindFirstOne
source: Congratulations! You just stored your first password, that's great! Remember to back up your data regularly to avoid the risk of losing it.
zh_cn: 恭喜！你刚刚记录了第一个账号，真不错，要记得定期备份一下数据哦，不要让数据面临丢失的风险。

# BackupRemindSpecificCount1
source: Wow, you've already stored
zh_cn: 哇，你已经记录了

# BackupRemindSpecificCount2
source: passwords, that's great! But remember to back up your data regularly to avoid the risk of losing it.
zh_cn: 个账号，真不错，但是要记得定期备份一下数据哦，不要让数据面临丢失的风险。

# TipsTitleTextBlock.Text
source: Tips
zh_cn: 使用提示

# TipsDescriptionTextBlock.Text
source: FAQs. For other questions,
zh_cn: 常见疑问的说明，如有其他问题

# TipsContactMeButton.Content
source: please contact me
zh_cn: 请联系我

# TipsContactMeButton.ToolTipService.ToolTip
source: Email to yaoyiming123@live.com
zh_cn: 向 yaoyiming123@live.com 发送邮件

# TipsWhereIsMyDataHeaderTextBlock.Text
source: Where is my data stored? How can I back it up?
zh_cn: 我的数据存储在哪里？我该如何备份？

# TipsWhereIsMyDataContentTextBlockRun1.Text
source: All data is stored in the folder and SQLite database file as shown in the image. "Honeypot" does not upload data to the network, so you need to back up this file manually.
zh_cn: 所有的数据保存在如图所示的文件夹和 SQLite 数据库文件中，"密罐" 不会将数据上传到网络，因此您需要自行将此文件备份。

# TipsWhereIsMyDataContentTextBlockRun2.Text
source: Please note that all data is stored in plain text. Please keep it safe!
zh_cn: 请注意，所有数据均为明文存储，务必妥善保管！

# TipsWhereIsMyDataContentTextBlockRun3.Text
source: Storing data in plain text means that anyone can use programs like SQLiteStudio to view the entire contents of the database file.
zh_cn: 明文存储意味着任何人都可以使用诸如 SQLiteStudio 等程序查看该数据库文件的一切内容。

# TipsWhereIsMyDataViewFileButton.Content
source: View Files
zh_cn: 查看数据库文件

# TipsHowToEditHeaderTextBlock.Text
source: How to edit or delete a category?
zh_cn: 怎样编辑或者删除一个分类？

# TipsHowToEditDemoTextBlock.Text
source: My Category
zh_cn: 我的分类

# TipsHowToEditContentTextBlockRun1.Text
source: To modify a category, simply click
zh_cn: 想要修改一个账号分类，只需点击左侧导航栏中的

# TipsHowToEditContentTextBlockRun2.Text
source: Categories"
zh_cn: 全部分类"

# TipsHowToEditContentTextBlockRun3.Text
source: in the left navigation area, navigate to the Categories page, then hover your mouse over the category you want to modify. You can right-click on it to take actions.
zh_cn: 跳转到分类页面，然后将鼠标指向想要修改的分类项，即可单击右键来进行操作了。

# TipsWhyNoIconHeaderTextBlock.Text
source: Why can't I set an icon when creating a category?
zh_cn: 为什么我创建分类时，无法设置图标？

# TipsWhyNoIconContentTextBlock.Text
source: The icons for categories come from the built-in Windows 11 font, Segoe Fluent Icons. This font is usually pre-installed on your device. If this font is deleted, "Honeypot" will not be able to retrieve the icon list, and you will be unable to select icons for your categories.
zh_cn: 分类的图标来自 Windows 11 内置字体 Segoe Fluent Icons，这个字体通常会内置在您的设备上。如果这个字体被删除，"密罐" 就获取不到相应的图标列表，也就无法供您选择分类的图标了。
